{
  "version": "2.2",
  "description": "Dependency Walker is a free utility that scans any 32-bit or 64-bit Windows module (exe, dll, ocx, sys, etc.) and builds a hierarchical tree diagram of all dependent modules. For each module found, it lists all the functions that are exported by that module, and which of those functions are actually being called by other modules. Another view displays the minimum set of required files, along with detailed information about each file including a full path to the file, base address, version numbers, machine type, debug information, and more. Dependency Walker is also very useful for troubleshooting system errors related to loading and executing modules. Dependency Walker detects many common application problems such as missing modules, invalid modules, import/export mismatches, circular dependency errors, mismatched machine types of modules, and module initialization failures. Dependency Walker runs on Windows 95, 98, Me, NT, 2000, XP, 2003, Vista, 7, and 8. It can process any 32-bit or 64-bit Windows module, including ones designed for Windows CE. It can be run as graphical application or as a console application. Dependency Walker handles all types of module dependencies, including implicit, explicit (dynamic / runtime), forwarded, delay-loaded, and injected. A detailed help is included. Dependency Walker is completely free to use. However, you may not profit from the distribution of it, nor may you bundle it with another product.",
  "homepage": "http://www.dependencywalker.com/",
  "license": "Unknown",
  "architecture": {
    "64bit": {
      "url": "http://www.dependencywalker.com/depends22_x64.zip",
      "hash": "35db68a613874a2e8c1422eb0ea7861f825fc71717d46dabf1f249ce9634b4f1"
    }
  },
  "bin": "depends.exe",
  "shortcuts": [
    [
      "depends.exe",
      "Dependency Walker"
    ]
  ],
  "checkver": {
    "url": "http://www.dependencywalker.com/",
    "regex": "Dependency Walker ([\\d.]+)"
  },
  "autoupdate": {
    "url": "http://www.dependencywalker.com/depends22_x64.zip",
    "hash": {
      "mode": "download"
    }
  }
}